# დაწერე პროგრამა, რომელიც რიცხვებს 1-დან 100-ის ჩათვლით შეამოწმებს:
# თუ რიცხვი იყოფა 3-ზე უნაშთოდ, გამოიტანე Fizz.
# თუ რიცხვი იყოფა 5-ზე უნაშთოდ, გამოიტანე Buzz.
# თუ რიცხვი ერთდროულად იყოფა 3-ზეც და 5-ზეც, გამოიტანე FizzBuzz.
# სხვა შემთხვევაში გამოიტანე თვითონ რიცხვი.

#%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% წინა დავალებაში ზუსტად იგივე გვქონდა %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

#12 nomeri iyo


num_3=int(input("Enter the number: "))
if num_3 % 3 == 0 and num_3 % 5==0:
    print("FizzBuzz")
elif num_3 % 3 == 0:
    print("Fizz")
elif num_3 % 5 == 0:
    print("Buzz")
else:
    print(num_3)
