# დაბეჭდეთ 0-დან 100-მდე არსებული ფიბონაჩის რიცხვები (ფიბონაჩის რიცხვებია 1, 1, 2, 3, 5, 8, 13, ... ყოველი მომდევნო რიცხვი
# წინა ორი რიცხვის ჯამს უდრის, საწყისი ორი რიცხვი არის 1 და 1).

# for i in range(1, 101):
#     for j in range(0,i):
#         print(i+j)
#         break
# for-ით ვერ მივხვდი როგორ შეიძლება ამის გაკეთება

# x=1
# y=1
# while x <= 100:
#     print(x)
#     x=y
#     y=x+y

#აქ ფიბონაჩი არ გამომივიდა უბრალოდ დავუმატე

x=1
y=1
while x <= 100:
    print(x)
    x , y = y, x+y
